[
  "table-editor-obsidian",
  "obsidian-kanban",
  "obsidian-icon-folder",
  "cm-editor-syntax-highlight-obsidian",
  "homepage",
  "tag-wrangler",
  "google-calendar",
  "obsidian-style-settings",
  "obsidian-wikipedia",
  "periodic-notes",
  "update-time-on-edit",
  "obsidian-regex-replace",
  "obsidian-frontmatter-tag-suggest",
  "calendar",
  "dataview",
  "vscode-editor"
]