{
  "users": [
    {
      "id": "9193",
      "username": "shyl",
      "email": "shyl@ex.co",
      "password": "$2b$10$wV5syJS/qSWyvqHeO7Ef0.6Oq5n8hAAOsRjpkyxtH6UduagrGPTyK",
      "uuid": "a6d3e8b3-43b1-4701-a2c4-8c32f4942f8d"
    },
    {
      "id": "db96",
      "username": "snfou7i",
      "email": "snfou7i@outlook.com",
      "password": "$2b$10$rSI.X006Vx34zvGkF3poreWhzTuIqKMJambbQxM3QuJydFvZcnZ1W",
      "uuid": "1d6d5086-c72d-4de9-88ff-7eabda2d5827"
    },
    {
      "id": "d9b1",
      "username": "user4",
      "email": "user4@gmail.com",
      "password": "$2b$10$lw.qQ2h0VnZtLNCui4fbMusdHydaziebejIwHbLasb3OkSAvPbzD2",
      "uuid": "4ae41f78-f25f-44c6-b9f2-02c48d55882c"
    },
    {
      "id": "e578",
      "username": "Zak the legend",
      "email": "zak@gmail.com",
      "password": "$2b$10$.Fnlv5.6.KQ5qihW94qkaO9sjHR7vFX1a9.GSk4pGG4wiZhXtR0pm",
      "uuid": "cab992a1-c972-4150-8ac8-5bc1ff75e506"
    }
  ],
  "books": [
    {
      "id": "c124",
      "title": "Rich Dad Poor Dad",
      "author": "Robert T. Kiyosaki",
      "publication_year": "2017",
      "description": "Robert's story of growing up with two dads, his real father and the father of his best friend, his rich dad.",
      "genre": "Business",
      "authorId": "a6d3e8b3-43b1-4701-a2c4-8c32f4942f8d",
      "cover_image": "/cover/rich-dad-poor-dad-cover.webp",
      "reviews": [
        {
          "user": "shyl",
          "comment": "So far I am half way through the book, I didn’t have the best start in life and I wanted to change that outcome for my children and I. I was never educated with money or taught how to be smart with it as my mom wasn’t great with it either, I am smart with my education but not money. I always wanted to be different financially but didn’t know where to start and this book has given me the key. I’m so glad I found this book at 28 instead of 58. I cannot stress enough the importance of getting your children and future generations to read this book as braking that cycle now will pay off later for them. We as parents always want our children to do well and not face the problems we do, start with this book and educate them before they leave home. It will be one of the best things you can do."
        }
      ],
      "rating": {
        "likes": 0,
        "dislikes": 0
      }
    },
    {
      "id": "d50d",
      "title": "The Alchemist",
      "authorId": "1d6d5086-c72d-4de9-88ff-7eabda2d5827",
      "author": "Paulo Coelho",
      "publication_year": "2013",
      "description": "Every few decades a book is published that changes the lives of its readers forever. This is such a book - a beautiful parable about learning to listen to your heart, read the omens strewn along life's path and, above all, follow your dreams.",
      "genre": "Drama, Quest, Adventure fiction",
      "cover_image": "/cover/the-alchemist-cover.webp",
      "reviews": [
        {
          "user": "shyl",
          "comment": "I'm not sure that I can capture my utter disdain for this book in words, but I'll give it a shot. I read this book about three years ago and just had to re-read it for book club. It was a steaming pile of crap then and, guess what?, it's a steaming pile of crap now. The main reason I hate this book: it's trite inspirational literature dressed up as an adventure quest. You go into it thinking that it's going to be about a boy's quest for treasure. If you read the back, there are words like \"Pyramids,\" \"Gypsy,\" \"alchemist.\" Turns out, this is just The Purpose Driven Life dressed up with a little fable. It's Hallmark Hall of Fame territory set in an exotic locale. Which pisses me off to no end as I normally try to dodge that sort of thing, but here it is masquerading as the type of book I normally like. It's cliche, didactic, and poorly written. "
        }
      ],
      "rating": {
        "likes": 0,
        "dislikes": 0
      }
    },
    {
      "id": "ff05",
      "title": "Mein Kampf (German: “My Struggle”)",
      "authorId": "cab992a1-c972-4150-8ac8-5bc1ff75e506",
      "author": "Adolf Hitler",
      "publication_year": "1925",
      "description": "a 1925 autobiographical manifesto by Nazi Party leader Adolf Hitler. The work describes the process by which Hitler became antisemitic and outlines his political ideology and future plans for Germany.",
      "genre": "Autobiography, War",
      "cover_image": "/cover/mein-kampf-cover.jpg",
      "reviews": []
    }
  ]
}